Masmiseim36/nxpSDK/devices/MKE06Z4/drivers/fsl_mscan.c
/* MsCAN ISR for transactional APIs. */
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
static mscan_isr_t s_mscanIsr = (mscan_isr_t)DefaultISR;
#else
static mscan_isr_t s_mscanIsr;
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/

static uint32_t MSCAN_GetInstance(MSCAN_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_mscanBases); instance++)
    {
        if (s_mscanBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_mscanBases));

    return instance;
}

static void MSCAN_EnterInitMode(MSCAN_Type *base)
{
    /* Set initial request bit. */
    base->CANCTL0 |= MSCAN_CANCTL0_INITRQ_MASK;

    /* Wait until the MsCAN Module enters initial mode. */
    while (0U == (base->CANCTL1 & MSCAN_CANCTL1_INITAK_MASK))
    {
    }
}

static void MSCAN_ExitInitMode(MSCAN_Type *base)
{
    /* Clear initial request bit. */
    base->CANCTL0 &= ~((uint8_t)MSCAN_CANCTL0_INITRQ_MASK);

    /* Wait until the MsCAN Module exits initial mode. */
    while (0U != (base->CANCTL1 & MSCAN_CANCTL1_INITAK_MASK))
    {
    }
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_IMPROVED_TIMING_CONFIG) && FSL_FEATURE_FLEXCAN_HAS_IMPROVED_TIMING_CONFIG)
/*!
 * @brief Calculates the segment values for a single bit time for classical MSCAN
 *
 * @param baudRate The data speed in bps
 * @param tqNum Number of time quantas per bit
 * @param pconfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if valid Segments found, FALSE if failed to get valid segments
 */
static bool MSCAN_GetSegments(uint32_t baudRate, uint32_t tqNum, mscan_timing_config_t *pconfig)
{
    uint32_t ideal_sp;
    uint32_t p1;
    bool fgRet;

    /* get ideal sample point. */
    if (baudRate >= 1000000)
        ideal_sp = IDEAL_SP_LOW;
    else if (baudRate >= 800000)
        ideal_sp = IDEAL_SP_MID;
    else
        ideal_sp = IDEAL_SP_HIGH;

    /* distribute time quanta. */
    p1 = tqNum * (uint32_t)ideal_sp;

    /* Caculate for time segment 1. */
    pconfig->timeSeg1 = p1 / IDEAL_SP_FACTOR - 1U;
    if (pconfig->timeSeg1 > MAX_TSEG1)
    {
        pconfig->timeSeg1 = MAX_TSEG1;
    }

    /* Caculate for time sgement 2. */
    pconfig->timeSeg2 = tqNum - (1U + pconfig->timeSeg1 + 1U);

    /* reference Manual document requirment. */
    if ((pconfig->timeSeg1 < MIN_TSEG1) || (pconfig->timeSeg2 < MIN_TSEG2))
    {
        fgRet = false;
    }
    else
    {
        assert(pconfig->timeSeg2 <= MAX_TSEG2);

        /* subtract one TQ for sync seg. */
        /* sjw is 20% of total TQ, rounded to nearest int. */
        pconfig->sJumpwidth = (tqNum + (5 - 1)) / 5 - 1U;

        if (pconfig->sJumpwidth > MAX_SJW)
        {
            pconfig->sJumpwidth = MAX_SJW;
        }

        fgRet = true;
    }
    return fgRet;
}

/*!
 * @brief Calculates the improved timing values by specific baudrates for classical MSCAN
 *
 * @param baudRate  The classical MSCAN speed in bps defined by user
 * @param sourceClock_Hz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param pconfig Pointer to the MSCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
static bool MSCAN_CalculateImprovedTimingValues(uint32_t baudRate,
                                                uint32_t sourceClock_Hz,
                                                mscan_timing_config_t *pconfig)
{
    uint32_t clk;   /* the clock is tqNumb x baudRateFD. */
    uint32_t clk2;  /* the clock2 is clk2 / Pre-scaler Division Factor. */
    uint32_t tqNum; /* Numbers of TQ. */
    bool fgRet = false;

    /* observe baud rate maximums. */
    assert(baudRate <= MAX_CAN_BAUDRATE);

    /*  Auto Improved Protocal timing for CBT. */
    for (tqNum = MSCAN_MAX_TIME_QUANTA; tqNum >= MSCAN_MIN_TIME_QUANTA; tqNum--)
    {
        clk = baudRate * tqNum;
        if (clk > sourceClock_Hz)
        {
            continue; /* tqNum too large, clk has been exceed sourceClock_Hz. */
        }

        for (pconfig->priDiv = 0x00; pconfig->priDiv <= MAX_BRP; (pconfig->priDiv)++)
        {
            /* Consider some proessor not contain FPU, the parameter need to be exact division. */
            if ((clk / (pconfig->priDiv + 1U) * (pconfig->priDiv + 1U)) != clk)
            {
                continue; /* clk need to be exact division by preDivider + 1. */
            }
            clk2 = clk / (pconfig->priDiv + 1U);
            if (((sourceClock_Hz / clk2) * clk2) != sourceClock_Hz)
            {
                continue; /* sourceClock_Hz need to be exact division by preDivider. */
            }
            if (MSCAN_GetSegments(baudRate, tqNum, pconfig))
            {
                /* Get the best timing configuration. */
                fgRet = true;
                break;
            }
        }
        if (fgRet)
        {
            break;
        }
    }

    return fgRet;
}
#endif

static void MSCAN_SetBaudRate(MSCAN_Type *base, uint32_t sourceClock_Hz, uint32_t baudRate_Bps)
{
    mscan_timing_config_t timingConfig;
    uint32_t priDiv = baudRate_Bps * (uint32_t)MSCAN_TIME_QUANTA_NUM;

    /* Assertion: Desired baud rate is too high. */
    assert(baudRate_Bps <= 1000000U);
    /* Assertion: Source clock should greater than baud rate * MSCAN_TIME_QUANTA_NUM. */
    assert(priDiv <= sourceClock_Hz);

#if (defined(FSL_FEATURE_FLEXCAN_HAS_IMPROVED_TIMING_CONFIG) && FSL_FEATURE_FLEXCAN_HAS_IMPROVED_TIMING_CONFIG)
    /* MsCAN timing setting formula:
     * MSCAN_TIME_QUANTA_NUM = 1 + (TSEG1 + 1) + (TSEG2 + 1);
     * We can calculate SEG1 and SEG2 according to the load factor
     */
    if (false == MSCAN_CalculateImprovedTimingValues(baudRate_Bps, sourceClock_Hz, &timingConfig))
#endif
    {
        if (0U == priDiv)
        {
            priDiv = 1U;
        }

        priDiv = (sourceClock_Hz / priDiv) - 1U;

        /* Desired baud rate is too low. */
        if (priDiv > 0x3FU)
        {
            priDiv = 0x3FU;
        }

        timingConfig.priDiv     = (uint8_t)priDiv;
        timingConfig.timeSeg1   = 3U;
        timingConfig.timeSeg2   = 2U;
        timingConfig.sJumpwidth = 0U;
    }
    timingConfig.samp = 0;

    /* Update actual timing characteristic. */
    MSCAN_SetTimingConfig(base, &timingConfig);
}

/*!
 * brief Initializes a MsCAN instance.
 *
 * This function initializes the MsCAN module with user-defined settings.
 * This example shows how to set up the mscan_config_t parameters and how
 * to call the MSCAN_Init function by passing in these parameters.
 *  code
 *   mscan_config_t mscanConfig;
 *   mscanConfig.clkSrc            = kMSCAN_ClkSrcOsc;
 *   mscanConfig.baudRate          = 1250000U;
 *   mscanConfig.enableTimer       = false;
 *   mscanConfig.enableLoopBack    = false;
 *   mscanConfig.enableWakeup      = false;
 *   mscanConfig.enableListen      = false;
 *   mscanConfig.busoffrecMode     = kMSCAN_BusoffrecAuto;
 *   mscanConfig.filterConfig.filterMode = kMSCAN_Filter32Bit;
 *   MSCAN_Init(MSCAN, &mscanConfig, 8000000UL);
 *   endcode
 *
 * param base MsCAN peripheral base address.
 * param config Pointer to the user-defined configuration structure.
 * param sourceClock_Hz MsCAN Protocol Engine clock source frequency in Hz.
 */
void MSCAN_Init(MSCAN_Type *base, const mscan_config_t *config, uint32_t sourceClock_Hz)
{
    uint8_t ctl0Temp, ctl1Temp;
    uint32_t u4temp;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    uint32_t instance;
#endif

    /* Assertion. */
    assert(NULL != config);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    instance = MSCAN_GetInstance(base);
    /* Enable MsCAN clock. */
    CLOCK_EnableClock(s_mscanClock[instance]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Enable MsCAN Module for configuartion. */
    MSCAN_Enable(base, true);

    /* Enter initialization mode for MSCAN configuration. */
    MSCAN_EnterInitMode(base);

    ctl0Temp = base->CANCTL0;
    ctl1Temp = base->CANCTL1;

    /* Enable Self Wake Up Mode. */
    ctl0Temp = (config->enableWakeup) ? ctl0Temp | (uint8_t)MSCAN_CANCTL0_WUPE_MASK :
                                        ctl0Temp & ~((uint8_t)MSCAN_CANCTL0_WUPE_MASK);
    /* Enable Loop Back Mode. */
    ctl1Temp = (config->enableLoopBack) ? ctl1Temp | (uint8_t)MSCAN_CANCTL1_LOOPB_MASK :
                                          ctl1Temp & ~((uint8_t)MSCAN_CANCTL1_LOOPB_MASK);
    /* Enable Listen Mode. */
    ctl1Temp = (config->enableListen) ? ctl1Temp | (uint8_t)MSCAN_CANCTL1_LISTEN_MASK :
                                        ctl1Temp & ~((uint8_t)MSCAN_CANCTL1_LISTEN_MASK);
    /* Clock source selection. */
    ctl1Temp = (kMSCAN_ClkSrcBus == config->clkSrc) ? ctl1Temp | (uint8_t)MSCAN_CANCTL1_CLKSRC_MASK :
                                                      ctl1Temp & ~((uint8_t)MSCAN_CANCTL1_CLKSRC_MASK);

    /* Save CTLx Configuation. */
    base->CANCTL0 = ctl0Temp;
    base->CANCTL1 = ctl1Temp;

    /* Configure ID acceptance filter setting. */
    MSCAN_SetIDFilterMode(base, config->filterConfig.filterMode);
    u4temp = config->filterConfig.u32IDAR0; /* To fix MISRA-C 2012 Rule 11.8 issue. */
    MSCAN_WriteIDAR0(base, (uint8_t *)(&u4temp));
    u4temp = config->filterConfig.u32IDMR0;
    MSCAN_WriteIDMR0(base, (uint8_t *)(&u4temp));
    u4temp = config->filterConfig.u32IDAR1;
    MSCAN_WriteIDAR1(base, (uint8_t *)(&u4temp));
    u4temp = config->filterConfig.u32IDMR1;
    MSCAN_WriteIDMR1(base, (uint8_t *)(&u4temp));

